<template>
	<div>
		<div id="title">{{title}}</div>
		<hr>
		<div id="content" v-html="content">
		</div>
	</div>
</template>
<script>
export default{
  name: 'AcademyProfile',
  data () {
    return {
      title: '东北大学计算机科学与工程学院简介',
      indexContent: '<p style="margin: 5px;">东北大学计算机科学与工程学院于2015年12月成立，其历史可追溯至1923年建校时设立的电工学系，并于20世纪50年代创建了无线电专业和计算机专业。在计算机科学与技术、信息与通信工程两个一级学科的发展历程中，创造了一个又一个值得载入史册的辉煌成绩：成功研制了我国第一台模拟电子计算机，自主研制了我国第一台CT机，在国内第一批设立无线电专业，培养出我国第一批计算机专业本科毕业生，设立国家第一批计算机应用博士点并培养出我国第一位计算机应用博士，孕育了国内第一家软件上市公司，建立了中国第一个局部互联网……</p><p style="margin: 5px;">学院现有教职工168人，其中专任教师118人，全日制学生3498人。设有计算机科学系、计算机工程系、通信与电子工程系3个系，大数据及人工智能技术、嵌入式系统及安全互联、医学信息系统及数字医疗和教学研究中心等4个研究中心。学院有图灵奖获得者（法国科学院院士，法国工程院院士，欧洲科学院院士，美国科学院院士，IEEE Fellow）1人、欧洲科学院院士（IEEE Fellow）1人、国务院学科评议组成员1人、国家“千人计划”入选者2人、“长江学者奖励计划”特聘教授2人、国家杰出青年科学基金获得者2人、国家百千万人才工程百人层次2人、万人计划青年拔尖人才1人、国家优秀青年基金获得者2人、教育部跨（新）世纪优秀人才13人、辽宁省教学名师2人。此外，还有包括2名院士在内的几十位国内外著名学者在学院兼职任教。</p> <p style="margin: 5px;">学院现有计算机科学与技术、通信工程、电子信息工程、物联网工程4个本科专业，有计算机科学与技术、信息与通信工程两个一级学科博士学位授权点和博士后工作流动站。计算机应用技术为二级学科国家重点学科，计算机科学与技术为一级学科辽宁省重点学科，通信与信息系统为二级学科辽宁省重点学科。计算机学科拥有和覆盖“软件架构新技术国家重点实验室”“计算机软件国家工程技术研究中心”“数字化医学影像设备国家工程技术研究中心”“国家级计算机实验教学示范中心”等13个国家、省部级学科和教学实验基地。计算机科学与技术一级学科在三次全国一级学科整体水平评估中两次位居第九、一次位居第十。2013年、2015年，计算机科学与技术学科两次进入ESI排名全球前1%。</p> <p style="margin: 5px;">近年来，学院科研氛围日益浓厚、科研规模日益扩大、科研水平日益提升，累计承担国家级科研项目175项，科研经费近5亿元，获得国家科技进步二等奖4项。</p><p style="margin: 0px;"> 学院积极开展多渠道、多层次的国际交流与合作，邀请大批国际知名专家来校开展交流合作。教师出国讲学、合作科研和进修的人数不断增加，学生作为交流生、互派生到国际知名院校深造的机会不断增多。</p><p style="margin: 0px;"> 学院注重学生创新创业氛围营造，学生在国际大学生程序设计竞赛、美国大学生数学建模竞赛、“挑战杯”等国际国内大赛中获奖近千人次。</p><p style="margin: 0px;"> 面向未来，东北大学计算机科学与工程学院将以“产学研、国际化”为特色，以一流的队伍、一流的教学、一流的科研和一流的管理体制和运行机制为保障，全面提升人才培养质量，把握发展机遇，拓宽学科方向，扩大国际影响，把东北大学计算机建成“国内一流、国际知名”的计算机学科。</p><p  style="display:block;float: right">2017年4月</p>',
      content: '<p style="margin: 5px;">东北大学计算机科学与工程学院于2015年12月成立，其历史可追溯至1923年建校时设立的电工学系，并于20世纪50年代创建了无线电专业和计算机专业。在计算机科学与技术、信息与通信工程两个一级学科的发展历程中，创造了一个又一个值得载入史册的辉煌成绩：成功研制了我国第一台模拟电子计算机，自主研制了我国第一台CT机，在国内第一批设立无线电专业，培养出我国第一批计算机专业本科毕业生，设立国家第一批计算机应用博士点并培养出我国第一位计算机应用博士，孕育了国内第一家软件上市公司，建立了中国第一个局部互联网……</p><p style="margin: 5px;">学院现有教职工168人，其中专任教师118人，全日制学生3498人。设有计算机科学系、计算机工程系、通信与电子工程系3个系，大数据及人工智能技术、嵌入式系统及安全互联、医学信息系统及数字医疗和教学研究中心等4个研究中心。学院有图灵奖获得者（法国科学院院士，法国工程院院士，欧洲科学院院士，美国科学院院士，IEEE Fellow）1人、欧洲科学院院士（IEEE Fellow）1人、国务院学科评议组成员1人、国家“千人计划”入选者2人、“长江学者奖励计划”特聘教授2人、国家杰出青年科学基金获得者2人、国家百千万人才工程百人层次2人、万人计划青年拔尖人才1人、国家优秀青年基金获得者2人、教育部跨（新）世纪优秀人才13人、辽宁省教学名师2人。此外，还有包括2名院士在内的几十位国内外著名学者在学院兼职任教。</p> <p style="margin: 5px;">学院现有计算机科学与技术、通信工程、电子信息工程、物联网工程4个本科专业，有计算机科学与技术、信息与通信工程两个一级学科博士学位授权点和博士后工作流动站。计算机应用技术为二级学科国家重点学科，计算机科学与技术为一级学科辽宁省重点学科，通信与信息系统为二级学科辽宁省重点学科。计算机学科拥有和覆盖“软件架构新技术国家重点实验室”“计算机软件国家工程技术研究中心”“数字化医学影像设备国家工程技术研究中心”“国家级计算机实验教学示范中心”等13个国家、省部级学科和教学实验基地。计算机科学与技术一级学科在三次全国一级学科整体水平评估中两次位居第九、一次位居第十。2013年、2015年，计算机科学与技术学科两次进入ESI排名全球前1%。</p> <p style="margin: 5px;">近年来，学院科研氛围日益浓厚、科研规模日益扩大、科研水平日益提升，累计承担国家级科研项目175项，科研经费近5亿元，获得国家科技进步二等奖4项。</p><p style="margin: 0px;"> 学院积极开展多渠道、多层次的国际交流与合作，邀请大批国际知名专家来校开展交流合作。教师出国讲学、合作科研和进修的人数不断增加，学生作为交流生、互派生到国际知名院校深造的机会不断增多。</p><p style="margin: 0px;"> 学院注重学生创新创业氛围营造，学生在国际大学生程序设计竞赛、美国大学生数学建模竞赛、“挑战杯”等国际国内大赛中获奖近千人次。</p><p style="margin: 0px;"> 面向未来，东北大学计算机科学与工程学院将以“产学研、国际化”为特色，以一流的队伍、一流的教学、一流的科研和一流的管理体制和运行机制为保障，全面提升人才培养质量，把握发展机遇，拓宽学科方向，扩大国际影响，把东北大学计算机建成“国内一流、国际知名”的计算机学科。</p><p  style="display:block;float: right">2017年4月</p>',
      structureContent: '<img style="width:80%; height:85%;margin-left:10%" src="http://www.cse.neu.edu.cn/js/kindeditor-4.1.10/attached/image/20151224/20151224115034_7470.png">',
      leaderContent: '<img style="width:80%; height:85%;margin-left:10%" src="http://www.cse.neu.edu.cn/js/kindeditor-4.1.10/attached/image/20160324/20160324211639_4378.png">'
    }
  },
  computed: {
    page: function () {
      return this.$route.params.page
    }
  },
  watch: {
    page: function () {
      console.log(this.page)
      if (this.page === 'index') {
        this.title = '东北大学计算机科学与工程学院简介'
        this.content = this.indexContent
      } else if (this.page === 'leader') {
        this.title = '学院领导'
        this.content = this.leaderContent
      } else if (this.page === 'structure') {
        this.title = '组织机构'
        this.content = this.structureContent
      }
    }
  }
}
</script>
<style scoped>
#title{
	font-size: 2rem;
	text-align: center;
}
#content{
	text-indent: 2rem;
	margin-top: 2px;
	font-size: 0.9rem;
	padding: 10px;
	height: 600px;
}
hr{
	width: 80%;
}
#content p{
	//display: block;
	margin-top: 2px;
	background-color: red;
}
</style>
